Revit 2024 API
TableSectionData.GetCellSpec Method
 Gets the spec describing values of a cell, if applicable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ForgeTypeId GetCellSpec(
	int nRow,
	int nCol
)
Visual Basic
Public Function GetCellSpec ( _
	nRow As Integer, _
	nCol As Integer _
) As ForgeTypeId
Visual C++
public:
ForgeTypeId^ GetCellSpec(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 The row index of the cell
nCol
Type: System.Int32
 The column index of the cell
Return Value
 Identifier of the spec, or empty if the cell does not contain a number with units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace